ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_stack_gatt_db.h
/***************************************************************************//**
* \file cy_ble_stack_gatt_db.h
* \version 2.0
*
* \brief
*  This file contains declarations of public BLE APIs of Generic Attribute Profile - GATT DB Access layer.
*  Also specified the defines, constants, and data structures required for the APIs.
* 
* Related Document:
*  BLE Standard Spec - CoreV4.2, CSS, CSAs, ESR05, ESR06
* 
********************************************************************************
* \copyright
* Copyright 2014-2017, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#ifndef CY_BLE_STACK_GATT_DB_H
#define CY_BLE_STACK_GATT_DB_H


/***************************************
* Common stack includes
***************************************/

#include "cy_ble_stack_gatt.h"

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/***************************************
** Macro Definition
***************************************/

/** GATT Defined Attributes */
#define CY_BLE_GATT_PRIMARY_SERVICE                      (0x2800u) /**< GATT Primary service */
#define CY_BLE_GATT_SECONDARY_SERVICE                    (0x2801u) /**< GATT secondary service */
#define CY_BLE_GATT_INCLUDE_SERVICE                      (0x2802u) /**< GATT included service */
#define CY_BLE_GATT_CHARACTERISTIC                       (0x2803u) /**< GATT characteristic */
#define CY_BLE_GATT_EXTENDED_PROPERTIES                  (0x2900u) /**< GATT extended properties */
#define CY_BLE_GATT_USER_DESCRIPTION                     (0x2901u) /**< GATT user description */
#define CY_BLE_GATT_CLIENT_CONFIG                        (0x2902u) /**< GATT client configuration */
#define CY_BLE_GATT_SERVER_CONFIG                        (0x2903u) /**< GATT server configuration */
#define CY_BLE_GATT_PRESENTATION_FORMAT                  (0x2904u) /**< GATT presentation format */
#define CY_BLE_GATT_AGGREGATE_FORMAT                     (0x2905u) /**< GATT aggregate format */

#define CY_BLE_GATT_GAP_SERVICE_UUID                     (0x1800u) /**< GATT GAP service UUID */

/** GATT Database Properties Field Description
    1. Attribute read permissions B0: Bluetooth Spec Defined
    2. Attribute write permissions B1: Bluetooth Spec Defined
    3. Characteristic properties B2: Bluetooth Spec Defined
    4. B3: Implementation Specific */

/** Attribute Read Permissions B0: Bluetooth Spec Defined */
/**\note: It is mandatory to set 'CY_BLE_GATT_DB_ATTR_PROP_RD_SEC_ENCRYPT' bit if either
          'CY_BLE_GATT_DB_ATTR_PROP_RD_SEC_AUTHENTICATE' or 'CY_BLE_GATT_DB_ATTR_PROP_RD_SEC_SC_AUTHENTICATE'
          bits are set. Otherwise these bits will be ignored. */
#define CY_BLE_GATT_DB_ATTR_PROP_READ                   (0x00000001u) /**< Attribute Read permission */
#define CY_BLE_GATT_DB_ATTR_PROP_RD_SEC_ENCRYPT         (0x00000002u) /**< Attribute Read with encryption */
#define CY_BLE_GATT_DB_ATTR_PROP_RD_SEC_AUTHENTICATE    (0x00000004u) /**< Attribute Read with authentication */
#define CY_BLE_GATT_DB_ATTR_PROP_RD_SEC_AUTHORIZE       (0x00000008u) /**< Attribute Read with authorization */
#define CY_BLE_GATT_DB_ATTR_PROP_RD_SEC_SC_AUTHENTICATE (0x00000010u) /**< Attribute Read with SC authentication */

#define CY_BLE_GATT_DB_ATTR_PROP_RD_MASK                (0x0000001Fu) /**< Attribute Read property bit mask */
#define CY_BLE_GATT_DB_ATTR_PROP_RD_BIT_SHIFT           (0x0u)        /**< Attribute Read property bit shift */
#define CY_BLE_GATT_DB_ATTR_PROP_RD_SECURITY_MASK       (0x0000001Eu) /**< Attribute Read prop security bit mask */
#define CY_BLE_GATT_DB_ATTR_PROP_RD_SECURITY_BIT_SHIFT  (0x1u)        /**< Attribute Read prop security bit shift */

/** Attribute Write Permissions B1: Bluetooth Spec Defined */
/**\note: It is mandatory to set 'CY_BLE_GATT_DB_ATTR_PROP_WR_SEC_ENCRYPT' bit if either 
          'CY_BLE_GATT_DB_ATTR_PROP_WR_SEC_AUTHENTICATE' or 'CY_BLE_GATT_DB_ATTR_PROP_WR_SEC_SC_AUTHENTICATE'
          bits are set. Otherwise these bits will be ignored. */
#define CY_BLE_GATT_DB_ATTR_PROP_WRITE                  (0x00000100u) /**< Attribute Write permission */
#define CY_BLE_GATT_DB_ATTR_PROP_WR_SEC_ENCRYPT         (0x00000200u) /**< Attribute Write with encryption */
#define CY_BLE_GATT_DB_ATTR_PROP_WR_SEC_AUTHENTICATE    (0x00000400u) /**< Attribute Write with authentication */
#define CY_BLE_GATT_DB_ATTR_PROP_WR_SEC_AUTHORIZE       (0x00000800u) /**< Attribute Write with authorization */
#define CY_BLE_GATT_DB_ATTR_PROP_WR_SEC_SC_AUTHENTICATE (0x00001000u) /**< Attribute Write with SC authentication */

#define CY_BLE_GATT_DB_ATTR_PROP_WR_MASK                (0x00001F00u) /**< Attribute Write property bit mask */
#define CY_BLE_GATT_DB_ATTR_PROP_WR_BIT_SHIFT           (0x8u)        /**< Attribute Write property bit shift */
#define CY_BLE_GATT_DB_ATTR_PROP_WR_SECURITY_MASK       (0x00001E00u) /**< Attribute Write prop security bit mask */
#define CY_BLE_GATT_DB_ATTR_PROP_WR_SECURITY_BIT_SHIFT  (0x9u)        /**< Attribute Write prop security bit shift */

/** Characteristic properties B2: Bluetooth Spec Defined */
#define CY_BLE_GATT_DB_CH_PROP_BROADCAST                 (0x00010000u) /**< characteristic property for broadcast */
#define CY_BLE_GATT_DB_CH_PROP_READ                      (0x00020000u) /**< characteristic property for read */
#define CY_BLE_GATT_DB_CH_PROP_RD_WRITE_WO_RESP          (0x00040000u) /**< characteristic property for wtite without response */
#define CY_BLE_GATT_DB_CH_PROP_WRITE                     (0x00080000u) /**< characteristic property for write */
#define CY_BLE_GATT_DB_CH_PROP_NOTIFY                    (0x00100000u) /**< characteristic property for notify */
#define CY_BLE_GATT_DB_CH_PROP_INDICATE                  (0x00200000u) /**< characteristic property for indication */
#define CY_BLE_GATT_DB_CH_PROP_SEC_AUTH_SIGNED_WRITE     (0x00400000u) /**< characteristic property for signed write */
#define CY_BLE_GATT_DB_CH_PROP_EXT_PROP                  (0x00800000u) /**< characteristic property for extended properties */

#define CY_BLE_GATT_DB_CHAR_PROP_MASK                    (0x00FF0000u) /**< characteristic property bit mask */
#define CY_BLE_GATT_DB_CHAR_PROP_BIT_SHIFT               (0x10u)       /**< characteristic property bit shift */

/** Extended properties values.*/
/**\note: These properties are not
   part of the permission field. The peer GATT layer or local GATT
   layer must read "Characteristic Extended Properties 
   Descriptor" value. */
#define CY_BLE_GATT_DB_CH_PROP_EXT_PROP_RELIABLE_WRITE   (0x0001u) /**< extended property of reliable write */
#define CY_BLE_GATT_DB_CH_PROP_EXT_PROP_WRITABLE_AUX     (0x0002u) /**< extended property of writable aux */
    
/** Implementation permissions B3: Implementation specific
   defines to access runtime characteristics. */

/** Bit Mask */
/** Characteristic read access event bit */
#define CY_BLE_GATT_DB_ATTR_CHAR_VAL_RD_EVENT            (0x01000000u)
/** characteristic CCCD bit */
#define CY_BLE_GATT_DB_CCCD_ATTR                         (0x02000000u)
/** attribute format */
#define CY_BLE_GATT_DB_ATTR_UUID_FMT_32                   (0x04000000u)
/** attribute format */
#define CY_BLE_GATT_DB_ATTR_UUID_FMT_128                    (0x08000000u)

/** Encryption Key Size 7 Needed for the Service */
#define CY_BLE_GATT_DB_SER_ENCRYPT_KEY_SIZE_7            (0x10000000u)

/** Encryption Key Size 8 Needed for the Service */
#define CY_BLE_GATT_DB_SER_ENCRYPT_KEY_SIZE_8            (0x20000000u)

/** Encryption Key Size 9 Needed for the Service */
#define CY_BLE_GATT_DB_SER_ENCRYPT_KEY_SIZE_9            (0x30000000u)

/** Encryption Key Size 10 Needed for the Service */
#define CY_BLE_GATT_DB_SER_ENCRYPT_KEY_SIZE_10           (0x40000000u)

/** Encryption Key Size 11 Needed for the Service */
#define CY_BLE_GATT_DB_SER_ENCRYPT_KEY_SIZE_11           (0x50000000u)

/** Encryption Key Size 12 Needed for the Service */
#define CY_BLE_GATT_DB_SER_ENCRYPT_KEY_SIZE_12           (0x60000000u)

