ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_stack_gatt_db.h
/** Encryption Key Size 13 Needed for the Service */
#define CY_BLE_GATT_DB_SER_ENCRYPT_KEY_SIZE_13           (0x70000000u)

/** Encryption Key Size 14 Needed for the Service */
#define CY_BLE_GATT_DB_SER_ENCRYPT_KEY_SIZE_14           (0x80000000u)

/** Encryption Key Size 15 Needed for the Service */
#define CY_BLE_GATT_DB_SER_ENCRYPT_KEY_SIZE_15           (0x90000000u)

/** Encryption Key Size 16 Needed for the Service */
#define CY_BLE_GATT_DB_SER_ENCRYPT_KEY_SIZE_16           (0xA0000000u)

/** No Encryption Needed for the Service */
#define CY_BLE_GATT_DB_SER_NO_ENCRYPT_PROPERTY           (0x00000000u)

/**  Encryption Key Size Mask Needed for the Service */
#define CY_BLE_GATT_DB_ENC_KEY_SIZE_MASK                 (0xF0000000u)

/** By default entries in CY_BLE_GATT DB is 16-bit UUID
   This mask is defined to decide UUID length */
#define CY_BLE_GATT_DB_ATTR_UUID_FMT_16_MASK             (0x03000000u)


/** CY_BLE_GATT Client Configuration values */
/** Client configuration notification */
#define CY_BLE_GATT_CLI_CNFG_NOTIFICATION                (0x0001u)
/** Client configuration indication */
#define CY_BLE_GATT_CLI_CNFG_INDICATION                  (0x0002u)
/** default configuration */
#define CY_BLE_GATT_CLI_CNFG_DEFAULT                     (0x0000u)

/** Unit size is with respect to word (16 bit) */
#define CY_BLE_GATT_DB_128_BIT_UUID_SZ                   (0x10u) /**< 128-bit uuid size */
#define CY_BLE_GATT_DB_32_BIT_UUID_SZ                    (0x04u) /**< 32-bit uuid size */
#define CY_BLE_GATT_DB_16_BIT_UUID_SZ                    (0x02u) /**< 16-bit uuid size */

#define CY_BLE_GATT_DB_ATTR_16_BIT_UUID                  (0x00u) /**< 128-bit uuid */
#define CY_BLE_GATT_DB_ATTR_32_BIT_UUID                  (0x01u) /**< 32-bit uuid */
#define CY_BLE_GATT_DB_ATTR_128_BIT_UUID                 (0x02u) /**< 16-bit uuid */

/** GATT DB attribute property Size */
#define CY_BLE_GATT_DB_ATTR_PRPTY_SZ                     (0x01u)

/** GATT DB attribute Handle Size */
#define CY_BLE_GATT_DB_ATTR_HANDLE_SZ                    (0x02u)

/** Locally initiated operation, needed for local updates based on Attribute
    Handles. */
#define CY_BLE_GATT_DB_LOCALLY_INITIATED                 (0x00u)

/** Peer Initiated GATT DB transaction */
#define CY_BLE_GATT_DB_PEER_INITIATED                    (0x40u)

/** Read operation for Attribute  */
#define CY_BLE_GATT_DB_READ                              (0x01u)

/** Write operation for Attribute */
#define CY_BLE_GATT_DB_WRITE                             (0x02u)

/** Prepare Write operation for Attribute */
#define CY_BLE_GATT_DB_PREP_WRITE                        (0x04u)

/** Write without response operation for Attribute */
#define CY_BLE_GATT_DB_WRITE_WITHOUT_RSP                 (0x80u)

/***************************************
** Data Struct Definition
***************************************/
/**
 \addtogroup group_ble_common_api_gatt_definitions
 @{
*/

/** Attribute value type used in GATT database */
typedef struct
{
    /** Length in number of bytes for attGenericVal */
    uint16_t actualLength;

    /** Buffer to the store generic characteristic value based on
       length or complete UUID value if the attribute is of type 128-bit
       UUID and 32-bit UUID type. */
    void * attGenericVal;

}cy_stc_ble_gatts_att_gen_val_len_t;

/** Attribute value type used in the GATT database */
typedef struct
{
    /** Length in number of bytes for attGenericVal */
    uint16_t maxAttrLength;

    /** Buffer to the store generic characteristic value based on
       length or complete UUID value if the attribute is of type 128-bit
       UUID and 32-bit UUID type. */
    cy_stc_ble_gatts_att_gen_val_len_t * attGenericValLen;

}cy_stc_ble_gatts_att_pack_val_len_t;

/** Attribute value type used in GATT database */
typedef union
{    
   /** Buffer containing 32-bit or 128-bit UUID values for Service and
      Characteristic declaration.
      Attribute format structure: if entry is for characteristic value format, 
      then it has the "attribute format value" of pointer type to represent generic
      structure to cater wide formats of available list of characteristic formats. */
    cy_stc_ble_gatts_att_pack_val_len_t      attFormatValue;

    /** Attribute UUID value */
    uint16_t                                 attValueUuid;

} cy_stc_ble_gatts_att_value_t;

/** GATT database structure used in the GATT Server */
typedef struct
{
    /** Start Handle: Act as an index for querying BLE GATT database */
    uint16_t                 attHandle;
    
    /** UUID: 16-bit UUID type for an attribute entry. For 32-bit and
       128-bit UUIDs, the last 16 bits should be stored in this entry
       that GATT DB access layer shall retrieve complete 128-bit UUID from the
       cy_ble_gatts_att_generic_val_t structure. */
    uint16_t                 attType;
    
    /** The permission bits are clubbed in a 32-bit field. These 
        32-bits can be grouped in four bytes. The lowest significant byte
        is byte 0 (B0) and the most significant byte is byte 3 (B3). The 
        bytes where the permissions have been grouped is as given below.
         * Attribute permissions for read (B0)
         * Attribute permissions for write (B1)
         * Characteristic properties (B2)
         * Implementation specific permission (B3)
         If permission is set to CY_BLE_GATT_DB_ATTR_CHAR_VAL_RD_EVENT, all GATT 
         characteristic read requests will be indicated to the application using
         the CY_BLE_EVT_GATTS_READ_CHAR_VAL_ACCESS_REQ event.
     */
    uint32_t                 permission;
    
    /** Attribute end handle, indicating logical boundary of given attribute. */
    uint16_t                 attEndHandle;
    
    /** Attribute value format, it can be one of following:
        * uint16_t 16bit - UUID for 16-bit service & characteristic declaration
        * cy_ble_gatts_att_generic_val_t attFormatValue - Buffer containing 32-bit
            or 128-bit UUID values for service & characteristic declaration
        * cy_ble_gatts_att_generic_val_t attFormatValue - Buffer containing generic 
            char definition value, or generic descriptor values
     */
    cy_stc_ble_gatts_att_value_t     attValue;
    
