ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_stack_gatt_db.h
 } cy_stc_ble_gatts_db_t; 

/** GATT database information parameters*/
typedef struct
{   
    /** Pointer to GATT DB */
    const cy_stc_ble_gatts_db_t    * gattDbPtr;

    /** Total number of entries in GATT DB */
    uint16_t                    gattDbTotalEntries;

    /**Maximum characteristic value length */
    uint16_t                    gattDbMaxValue;

} cy_stc_ble_gatts_db_info_t;

/** GATT database attribute value parameters*/
typedef struct
{   
    /** handle value pair of type cy_stc_ble_gatt_handle_value_pair_t.
             'handleValuePair.attrHandle' is an input for which a value must be read/written.
             'handleValuePair.value.len' is an input parameter for the length to be read/written.
             'handleValuePair.value.val' is an input parameter for the data buffer when writing and 
              output parameter when reading.
             'handleValuePair.actualLen' must be ignored as it is unused */
    cy_stc_ble_gatt_handle_value_pair_t  handleValuePair;

    /** Offset at which the data (length in number of bytes) is written */
    uint16_t                          offset;

    /** Connection Handle */
    cy_stc_ble_conn_handle_t             connHandle;

    /** Attribute permissions. Allowed values are,
             - CY_BLE_GATT_DB_LOCALLY_INITIATED
             - CY_BLE_GATT_DB_PEER_INITIATED */
    uint8_t                           flags;

} cy_stc_ble_gatts_db_attr_val_info_t;

/** GATT database attribute enable parameters*/
typedef struct
{   
    /** Attribute handle */
    cy_ble_gatt_db_attr_handle_t    attrHandle;

} cy_stc_ble_gatts_db_attr_enable_info_t;

/** GATT database attribute disable parameters*/
typedef cy_stc_ble_gatts_db_attr_enable_info_t      cy_stc_ble_gatts_db_attr_disable_info_t;

/** GATT database authorize parameters*/
typedef struct
{   
    /** Setting to '0' turns off authorization on the entire GATT database and all attributes marked 
            as authorize will return an authorization error. 
         Setting this to any non-zero value will authorize the entire GATT database and all attributes 
         marked as authorize can be read / written based on other allowed permissions. */
    uint8_t    authorize;

} cy_stc_ble_gatts_db_authorize_info_t;

/***************************************
** Characteristic Descriptors definitions
***************************************/
/** All descriptors follow the characteristic value definition entries that belong
   to a logical group of characteristics shall be in following order:
    1. Characteristic Declaration 
    2. Characteristic Value
    3. Characteristic Extended Property (If any)
    4. Characteristic User Description  (If any)
    5. Client Characteristic Configuration  (If any)
    6. Server Characteristic Configuration (If any)
    7. Characteristic Presentation Format (If any)
    8. Characteristic Aggregate Format (If any)
 */

/** Characteristic Extended Property */
typedef cy_stc_ble_gatts_att_value_t      cy_stc_ble_char_ext_prprty_t;
/** Characteristic User Description */
typedef cy_stc_ble_gatts_att_value_t      cy_stc_ble_char_user_description_t;
/** Client Characteristic Configuration */
typedef cy_stc_ble_gatts_att_value_t      cy_stc_ble_client_char_config_t;
/** Server Characteristic Configuration */
typedef cy_stc_ble_gatts_att_value_t      cy_stc_ble_server_char_config_t;
/** Characteristic Presentation Format */
typedef cy_stc_ble_gatts_att_value_t      cy_stc_ble_char_present_fmt_t;
/** Characteristic Aggregate Format */
typedef cy_stc_ble_gatts_att_value_t      cy_stc_ble_char_aggregate_fmt_t;
/** @} */

/***************************************
** Exported APIs
***************************************/

/**
 \addtogroup group_ble_common_api_gatt_server_functions
 @{
*/

/******************************************************************************
* Function Name: Cy_BLE_GATTS_DbRegister
***************************************************************************//**
* 
*  This function registers the GATT database for the GATT Server. The GATT 
*  database stores all the attributes used by the GATT server, along with their
*  permissions. This is a blocking function. No event is generated on calling
*  this function.
* 
*  \param param: Parameter is of type 'cy_stc_ble_gatts_db_info_t'.
* 
* \return
*  cy_en_ble_api_result_t: Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*  Errors codes                      | Description
*  ------------                      | -----------
*   CY_BLE_SUCCESS                   | On successful operation.
*   CY_BLE_ERROR_INVALID_PARAMETER   | If the Database has zero entries or is a NULL pointer.
* 
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_GATTS_DbRegister
(
    cy_stc_ble_gatts_db_info_t  * param
);

/******************************************************************************
* Function Name: Cy_BLE_GATTS_WriteAttributeValue
***************************************************************************//**
* 
*  This function is used to write to the value field of the specified attribute
*  in the GATT database of a GATT Server. This is a blocking function. No event
*  is generated on calling this function.
* 
*  If a peer device connected to the GATT Server initiates a write operation, 
*  this function is executed on the GATT Server. During such a call, the function
*  checks for the attribute permissions (flags) before executing the write 
*  operation.
* 
*  \param param: Parameter is of type 'cy_stc_ble_gatts_db_attr_val_info_t'.
* 
* \return
*  cy_en_ble_gatt_err_code_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*  Errors codes                                | Description
*  ------------                                | -----------
*  CY_BLE_GATT_ERR_NONE                        | On successful operation.
*  CY_BLE_GATT_ERR_INVALID_HANDLE              | 'handleValuePair.attrHandle' is not valid.
*  CY_BLE_GATT_ERR_WRITE_NOT_PERMITTED         | write operation is not permitted on this attribute (Peer Initiated).
*  CY_BLE_GATT_ERR_UNLIKELY_ERROR              | Invalid arguments passed.
*  CY_BLE_GATT_ERR_INSUFFICIENT_ENCRYPTION     | Link is not encrypted (Peer Initiated).
*  CY_BLE_GATT_ERR_INSUFFICIENT_ENC_KEY_SIZE   | Link is encrypted with insufficient key size (Peer Initiated).
*  CY_BLE_GATT_ERR_INSUFFICIENT_AUTHENTICATION | Link is un-authenticated (Peer Initiated).
*  CY_BLE_GATT_ERR_INSUFFICIENT_AUTHORIZATION  | Peer client is not authorized (Peer Initiated).
*  CY_BLE_GATT_ERR_INVALID_OFFSET              | param->offset is invalid.
*  CY_BLE_GATT_ERR_INVALID_ATTRIBUTE_LEN       | handleValuePair.value.len is invalid.
* 
******************************************************************************/
cy_en_ble_gatt_err_code_t Cy_BLE_GATTS_WriteAttributeValue
(
    cy_stc_ble_gatts_db_attr_val_info_t  * param
);

