ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_stack_gatt_db.h
/******************************************************************************
* Function Name: Cy_BLE_GATTS_ReadAttributeValue
***************************************************************************//**
* 
*  This function is used to read the value field of the specified attribute from
*  the GATT database in a GATT Server. This is a blocking function. No event is
*  generated on calling this function.
* 
*  A peer initiated call to this function results in the function checking for
*  attribute permissions before performing this operation.
*     
*  \param param: Parameter is of type 'cy_stc_ble_gatts_db_attr_val_info_t'.
*  param-> offset: not used, to be ignored
* 
* \return
*  cy_en_ble_gatt_err_code_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*  Errors codes                                | Description
*  ------------                                | -----------
*  CY_BLE_GATT_ERR_NONE                        | On successful operation.
*  CY_BLE_GATT_ERR_INVALID_HANDLE              | 'handleValuePair.attrHandle' is not valid.
*  CY_BLE_GATT_ERR_READ_NOT_PERMITTED          | Read operation is not permitted on this attribute (Peer Initiated).
*  CY_BLE_GATT_ERR_UNLIKELY_ERROR              | Invalid arguments passed.
*  CY_BLE_GATT_ERR_INSUFFICIENT_ENCRYPTION     | Link is not encrypted (Peer Initiated).
*  CY_BLE_GATT_ERR_INSUFFICIENT_ENC_KEY_SIZE   | Link is encrypted with insufficient key size (Peer Initiated).
*  CY_BLE_GATT_ERR_INSUFFICIENT_AUTHENTICATION | Link is un-authenticated (Peer Initiated).
*  CY_BLE_GATT_ERR_INSUFFICIENT_AUTHORIZATION  | Peer client is not authorized (Peer Initiated).
* 
******************************************************************************/
cy_en_ble_gatt_err_code_t Cy_BLE_GATTS_ReadAttributeValue
(
    cy_stc_ble_gatts_db_attr_val_info_t  * param
);

/******************************************************************************
* Function Name: Cy_BLE_GATTS_EnableAttribute
***************************************************************************//**
* 
*  This function enables the attribute entry for a service or characteristic
*  logical group in the GATT database registered in the BLE Stack. This is a
*  blocking function. No event is generated on calling this function.
* 
*  This function returns an error if the attribute does not belong to any 
*  service or characteristic logical group. If the attribute entry is already
*  enabled, then this function returns status CY_BLE_GATT_ERR_NONE.
* 
*  \param param: Parameter is of type 'cy_stc_ble_gatts_db_attr_enable_info_t'.
*              param->attrHandle: Attribute handle of the registered GATT Database to enable
*              particular attribute entry, of type 'cy_ble_gatt_db_attr_handle_t'.
* 
* \return
*  cy_en_ble_gatt_err_code_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*  Errors codes                       | Description
*  ------------                       | -----------
*   CY_BLE_GATT_ERR_NONE              | On successful operation.
*   CY_BLE_GATT_ERR_INVALID_HANDLE    | 'attrHandle' is not valid.
*  CY_BLE_GATT_ERR_UNLIKELY_ERROR     | NULL pointer as input parameter.
* 
******************************************************************************/
cy_en_ble_gatt_err_code_t Cy_BLE_GATTS_EnableAttribute
(
    cy_stc_ble_gatts_db_attr_enable_info_t  * param
);

/******************************************************************************
* Function Name: Cy_BLE_GATTS_DisableAttribute
***************************************************************************//**
* 
*  This function disables the attribute entry for service or characteristic
*  logical group in the GATT database registered in the BLE Stack. This is
*  a blocking function. No event is generated on calling this function.
* 
*  This function returns error if the attribute does not belong to a service or
*  a characteristic logical group. If attribute entry is already disabled then
*  it returns CY_BLE_GATT_ERR_NONE as the status. All the attribute entries are
*  enabled in the GATT database during stack initialization.
* 
*  \param param: Parameter is of type 'cy_stc_ble_gatts_db_attr_disable_info_t'.
*              param->attrHandle: Attribute handle of the registered GATT Database to disable
*               particular attribute entry, of type 'cy_ble_gatt_db_attr_handle_t'
* 
* \return
*  cy_en_ble_gatt_err_code_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*  Errors codes                       | Description
*  ------------                       | -----------
*   CY_BLE_GATT_ERR_NONE              | On successful operation.
*   CY_BLE_GATT_ERR_INVALID_HANDLE    | 'attrHandle' is not valid.
*  CY_BLE_GATT_ERR_UNLIKELY_ERROR     | NULL pointer as input parameter.
* 
******************************************************************************/
cy_en_ble_gatt_err_code_t Cy_BLE_GATTS_DisableAttribute
(
    cy_stc_ble_gatts_db_attr_disable_info_t  * param
);

/******************************************************************************
* Function Name: Cy_BLE_GATTS_DbAuthorize
***************************************************************************//**
* 
*  This Function sets or clears authorization permission for the GATT database
* 
*  \param param: Parameter is of type 'cy_stc_ble_gatts_db_authorize_info_t'.
* 
* \return
*  cy_en_ble_gatt_err_code_t : Return value indicates whether the function succeeded or
*  failed. Following are the possible error codes.
*
*  Errors codes                       | Description
*  ------------                       | -----------
*  CY_BLE_GATT_ERR_NONE               | On successful operation.
*  CY_BLE_GATT_ERR_UNLIKELY_ERROR     | If 'param' is NULL.
* 
******************************************************************************/
cy_en_ble_gatt_err_code_t Cy_BLE_GATTS_DbAuthorize
(
    cy_stc_ble_gatts_db_authorize_info_t  * param
);
        
/** @} */

/** \cond IGNORE */
/******************************************************************************
* Function Name: Cy_BLE_GATT_DbCheckPermission
***************************************************************************//**
* 
*  This API validates the security permission for the given attribute handle
* 
*  \param attrhandle: Attribute handle of type 'cy_ble_gatt_db_attr_handle_t'
*  \param connHandle: Connection handle of type 'cy_stc_ble_conn_handle_t'
*  \param flags: flag to identify if request is peer initiated (CY_BLE_GATT_DB_PEER_INITIATED) 
*                       or local initiated (CY_BLE_GATT_DB_LOCALLY_INITIATED).
* 
* \return
*  cy_en_ble_gatt_err_code_t : Return value indicates whether the function succeeded or
*  failed with GATT error codes. For details, refer to Bluetooth 4.2 spec, vol3, part F, Table 3.3 
* 
******************************************************************************/
cy_en_ble_gatt_err_code_t Cy_BLE_GATT_DbCheckPermission
(
   cy_ble_gatt_db_attr_handle_t  attrhandle,
   cy_stc_ble_conn_handle_t          * connHandle,
   uint8_t                        flags
);

/** \endcond */

#ifdef __cplusplus
}
#endif /* __cplusplus */


#endif /*CY_BLE_STACK_GATT_DB_H*/


/*EOF*/
